stevenj/avr-libc3/include/avr/io/attiny2313a.h
/* Watchdog Reset Flag */
typedef enum CPU_WDRF_enum
{
    CPU_WDRF_CLEAR_gc = (0x00), /* Watchdog Reset Flag - CLEAR */
    CPU_WDRF_SET_gc   = (0x08), /* Watchdog Reset Flag - SET */
} CPU_WDRF_t;

/* Brown-out Reset Flag */
typedef enum CPU_BORF_enum
{
    CPU_BORF_CLEAR_gc = (0x00), /* Brown-out Reset Flag - CLEAR */
    CPU_BORF_SET_gc   = (0x04), /* Brown-out Reset Flag - SET */
} CPU_BORF_t;

/* External Reset Flag */
typedef enum CPU_EXTRF_enum
{
    CPU_EXTRF_CLEAR_gc = (0x00), /* External Reset Flag - CLEAR */
    CPU_EXTRF_SET_gc   = (0x02), /* External Reset Flag - SET */
} CPU_EXTRF_t;

/* Power-On Reset Flag */
typedef enum CPU_PORF_enum
{
    CPU_PORF_CLEAR_gc = (0x00), /* Power-On Reset Flag - CLEAR */
    CPU_PORF_SET_gc   = (0x01), /* Power-On Reset Flag - SET */
} CPU_PORF_t;

/* Clock Prescaler Change Enable */
typedef enum CPU_CLKPCE_enum
{
    CPU_CLKPCE_CLEAR_gc = (0x00), /* Clock Prescaler Change Enable - CLEAR */
    CPU_CLKPCE_SET_gc   = (0x80), /* Clock Prescaler Change Enable - SET */
} CPU_CLKPCE_t;

/* Clock Prescaler Select Bits */
typedef enum CPU_CLKPS_enum
{
    CPU_CLKPS_VAL_0x00_gc = (0x00), /* 1 */
    CPU_CLKPS_VAL_0x01_gc = (0x01), /* 2 */
    CPU_CLKPS_VAL_0x02_gc = (0x02), /* 4 */
    CPU_CLKPS_VAL_0x03_gc = (0x03), /* 8 */
    CPU_CLKPS_VAL_0x04_gc = (0x04), /* 16 */
    CPU_CLKPS_VAL_0x05_gc = (0x05), /* 32 */
    CPU_CLKPS_VAL_0x06_gc = (0x06), /* 64 */
    CPU_CLKPS_VAL_0x07_gc = (0x07), /* 128 */
    CPU_CLKPS_VAL_0x08_gc = (0x08), /* 256 */
} CPU_CLKPS_t;

/* General Timer Counter Control Register-PSR10 */
typedef enum CPU_PSR10_enum
{
    CPU_PSR10_CLEAR_gc = (0x00), /* General Timer Counter Control Register-PSR10 - CLEAR */
    CPU_PSR10_SET_gc   = (0x01), /* General Timer Counter Control Register-PSR10 - SET */
} CPU_PSR10_t;

/* Power reduction register-PRTIM */
#define CPU_PRR_PRTIM_gc(x) ((x<<2) & 0x0C)

/* Power reduction register-PRUSI */
typedef enum CPU_PRUSI_enum
{
    CPU_PRUSI_CLEAR_gc = (0x00), /* Power reduction register-PRUSI - CLEAR */
    CPU_PRUSI_SET_gc   = (0x02), /* Power reduction register-PRUSI - SET */
} CPU_PRUSI_t;

/* Power reduction register-PRUSART */
typedef enum CPU_PRUSART_enum
{
    CPU_PRUSART_CLEAR_gc = (0x00), /* Power reduction register-PRUSART - CLEAR */
    CPU_PRUSART_SET_gc   = (0x01), /* Power reduction register-PRUSART - SET */
} CPU_PRUSART_t;

/* BOD control register-BPDS */
typedef enum CPU_BPDS_enum
{
    CPU_BPDS_CLEAR_gc = (0x00), /* BOD control register-BPDS - CLEAR */
    CPU_BPDS_SET_gc   = (0x02), /* BOD control register-BPDS - SET */
} CPU_BPDS_t;

/* BOD control register-BPDSE */
typedef enum CPU_BPDSE_enum
{
    CPU_BPDSE_CLEAR_gc = (0x00), /* BOD control register-BPDSE - CLEAR */
    CPU_BPDSE_SET_gc   = (0x01), /* BOD control register-BPDSE - SET */
} CPU_BPDSE_t;
/*
================================================================================
IO Module Instances. Mapped to memory.
================================================================================
*/

#define PORTB   (*(PORTB_t *) 0x0000)   /* I/O Port */
#define PORTD   (*(PORTD_t *) 0x0000)   /* I/O Port */
#define PORTA   (*(PORTA_t *) 0x0000)   /* I/O Port */
#define TC0     (*(TC0_t *) 0x0000)     /* Timer/Counter, 8-bit */
#define TC1     (*(TC1_t *) 0x0000)     /* Timer/Counter, 16-bit */
#define WDT     (*(WDT_t *) 0x0000)     /* Watchdog Timer */
#define USART   (*(USART_t *) 0x0000)   /* USART */
#define AC      (*(AC_t *) 0x0000)      /* Analog Comparator */
#define EEPROM  (*(EEPROM_t *) 0x0000)  /* EEPROM */
#define USI     (*(USI_t *) 0x0000)     /* Universal Serial Interface */
#define EXINT   (*(EXINT_t *) 0x0000)   /* External Interrupts */
#define CPU     (*(CPU_t *) 0x0000)     /* CPU Registers */
#define FUSE    (*(FUSE_t *) 0x0000)    /* Fuses */
#define LOCKBIT (*(LOCKBIT_t *) 0x0000) /* Lockbits */
#else
/*
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ASM LANGUAGE - ONLY
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
*/


/*
--------------------------------------------------------------------------------
FUSE - Fuses
--------------------------------------------------------------------------------
*/


/* Self Programming enable */
#define FUSE_SELFPRGEN_CLEAR_gc (0x00) /* Self Programming enable - CLEAR */
#define FUSE_SELFPRGEN_SET_gc   (0x01) /* Self Programming enable - SET */


/* Debug Wire enable */
#define FUSE_DWEN_CLEAR_gc (0x00) /* Debug Wire enable - CLEAR */
#define FUSE_DWEN_SET_gc   (0x80) /* Debug Wire enable - SET */


/* Preserve EEPROM through the Chip Erase cycle */
#define FUSE_EESAVE_CLEAR_gc (0x00) /* Preserve EEPROM through the Chip Erase cycle - CLEAR */
#define FUSE_EESAVE_SET_gc   (0x40) /* Preserve EEPROM through the Chip Erase cycle - SET */


/* Serial program downloading (SPI) enable */
#define FUSE_SPIEN_CLEAR_gc (0x00) /* Serial program downloading (SPI) enable - CLEAR */
#define FUSE_SPIEN_SET_gc   (0x20) /* Serial program downloading (SPI) enable - SET */


/* Watch-dog Timer always on */
#define FUSE_WDTON_CLEAR_gc (0x00) /* Watch-dog Timer always on - CLEAR */
#define FUSE_WDTON_SET_gc   (0x10) /* Watch-dog Timer always on - SET */


/* Brown-out Detector trigger level */
#define FUSE_BODLEVEL_4V3_gc      (0x04<<1) /* Brown-out detection at VCC=4.3 V */
#define FUSE_BODLEVEL_2V7_gc      (0x05<<1) /* Brown-out detection at VCC=2.7 V */
#define FUSE_BODLEVEL_1V8_gc      (0x06<<1) /* Brown-out detection at VCC=1.8 V */
#define FUSE_BODLEVEL_DISABLED_gc (0x07<<1) /* Brown-out detection disabled */


/* External reset disable */
#define FUSE_RSTDISBL_CLEAR_gc (0x00) /* External reset disable - CLEAR */
#define FUSE_RSTDISBL_SET_gc   (0x01) /* External reset disable - SET */


/* Divide clock by 8 internally */
#define FUSE_CKDIV8_CLEAR_gc (0x00) /* Divide clock by 8 internally - CLEAR */
#define FUSE_CKDIV8_SET_gc   (0x80) /* Divide clock by 8 internally - SET */


/* Clock output on PORTD2 */
#define FUSE_CKOUT_CLEAR_gc (0x00) /* Clock output on PORTD2 - CLEAR */
#define FUSE_CKOUT_SET_gc   (0x40) /* Clock output on PORTD2 - SET */


/* Select Clock Source */
#define FUSE_SUT_CKSEL_EXTCLK_14CK_0MS_gc               (0x00) /* Ext. Clock; Start-up time: 14 CK + 0   ms */
#define FUSE_SUT_CKSEL_EXTCLK_14CK_4MS1_gc              (0x10) /* Ext. Clock; Start-up time: 14 CK + 4.1 ms */
#define FUSE_SUT_CKSEL_EXTCLK_14CK_65MS_gc              (0x20) /* Ext. Clock; Start-up time: 14 CK + 65  ms */
#define FUSE_SUT_CKSEL_INTRCOSC_4MHZ_14CK_0MS_gc        (0x02) /* Int. RC Osc. 4 MHz; Start-up time: 14 CK + 0   ms */
#define FUSE_SUT_CKSEL_INTRCOSC_4MHZ_14CK_4MS1_gc       (0x12) /* Int. RC Osc. 4 MHz; Start-up time: 14 CK + 4.1 ms */
#define FUSE_SUT_CKSEL_INTRCOSC_4MHZ_14CK_65MS_gc       (0x22) /* Int. RC Osc. 4 MHz; Start-up time: 14 CK + 65  ms */
#define FUSE_SUT_CKSEL_INTRCOSC_8MHZ_14CK_0MS_gc        (0x04) /* Int. RC Osc. 8 MHz; Start-up time: 14 CK + 0   ms */
#define FUSE_SUT_CKSEL_INTRCOSC_8MHZ_14CK_4MS1_gc       (0x14) /* Int. RC Osc. 8 MHz; Start-up time: 14 CK + 4.1 ms */
#define FUSE_SUT_CKSEL_INTRCOSC_8MHZ_14CK_65MS_gc       (0x24) /* Int. RC Osc. 8 MHz; Start-up time: 14 CK + 65  ms */
#define FUSE_SUT_CKSEL_INTRCOSC_128KHZ_14CK_0MS_gc      (0x06) /* Int. RC Osc. 128 kHz; Start-up time: 14 CK + 0 ms */
#define FUSE_SUT_CKSEL_INTRCOSC_128KHZ_14CK_4MS_gc      (0x16) /* Int. RC Osc. 128 kHz; Start-up time: 14 CK + 4 ms */
#define FUSE_SUT_CKSEL_INTRCOSC_128KHZ_14CK_64MS_gc     (0x26) /* Int. RC Osc. 128 kHz; Start-up time: 14 CK + 64 ms */
#define FUSE_SUT_CKSEL_EXTXOSC_0MHZ4_0MHZ9_14CK_4MS1_gc (0x08) /* Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 14 CK + 4.1 ms */
#define FUSE_SUT_CKSEL_EXTXOSC_0MHZ4_0MHZ9_14CK_65MS_gc (0x18) /* Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 14 CK + 65 ms */
#define FUSE_SUT_CKSEL_EXTXOSC_0MHZ4_0MHZ9_14CK_0MS_gc  (0x28) /* Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 14 CK + 0 ms */
/* WARNING: FUSE_SUT_CKSEL_EXTXOSC_0MHZ4_0MHZ9_14CK_4MS1_gc ALREADY DEFINED as '(0x08)' NOT '(0x38)' */
/* WARNING: FUSE_SUT_CKSEL_EXTXOSC_0MHZ4_0MHZ9_14CK_65MS_gc ALREADY DEFINED as '(0x18)' NOT '(0x09)' */
/* WARNING: FUSE_SUT_CKSEL_EXTXOSC_0MHZ4_0MHZ9_14CK_0MS_gc ALREADY DEFINED as '(0x28)' NOT '(0x19)' */
/* WARNING: FUSE_SUT_CKSEL_EXTXOSC_0MHZ4_0MHZ9_14CK_4MS1_gc ALREADY DEFINED as '(0x08)' NOT '(0x29)' */
/* WARNING: FUSE_SUT_CKSEL_EXTXOSC_0MHZ4_0MHZ9_14CK_65MS_gc ALREADY DEFINED as '(0x18)' NOT '(0x39)' */
#define FUSE_SUT_CKSEL_EXTXOSC_0MHZ9_3MHZ_14CK_4MS1_gc  (0x0A) /* Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 14 CK + 4.1 ms */
#define FUSE_SUT_CKSEL_EXTXOSC_0MHZ9_3MHZ_14CK_65MS_gc  (0x1A) /* Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 14 CK + 65 ms */
#define FUSE_SUT_CKSEL_EXTXOSC_0MHZ9_3MHZ_14CK_0MS_gc   (0x2A) /* Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 14 CK + 0 ms */
/* WARNING: FUSE_SUT_CKSEL_EXTXOSC_0MHZ9_3MHZ_14CK_4MS1_gc ALREADY DEFINED as '(0x0A)' NOT '(0x3A)' */
/* WARNING: FUSE_SUT_CKSEL_EXTXOSC_0MHZ9_3MHZ_14CK_65MS_gc ALREADY DEFINED as '(0x1A)' NOT '(0x0B)' */
/* WARNING: FUSE_SUT_CKSEL_EXTXOSC_0MHZ9_3MHZ_14CK_0MS_gc ALREADY DEFINED as '(0x2A)' NOT '(0x1B)' */
/* WARNING: FUSE_SUT_CKSEL_EXTXOSC_0MHZ9_3MHZ_14CK_4MS1_gc ALREADY DEFINED as '(0x0A)' NOT '(0x2B)' */
/* WARNING: FUSE_SUT_CKSEL_EXTXOSC_0MHZ9_3MHZ_14CK_65MS_gc ALREADY DEFINED as '(0x1A)' NOT '(0x3B)' */
#define FUSE_SUT_CKSEL_EXTXOSC_3MHZ_8MHZ_14CK_4MS1_gc   (0x0C) /* Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 14 CK + 4.1 ms */
#define FUSE_SUT_CKSEL_EXTXOSC_3MHZ_8MHZ_14CK_65MS_gc   (0x1C) /* Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 14 CK + 65 ms */
#define FUSE_SUT_CKSEL_EXTXOSC_3MHZ_8MHZ_14CK_0MS_gc    (0x2C) /* Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 14 CK + 0 ms */
/* WARNING: FUSE_SUT_CKSEL_EXTXOSC_3MHZ_8MHZ_14CK_4MS1_gc ALREADY DEFINED as '(0x0C)' NOT '(0x3C)' */
/* WARNING: FUSE_SUT_CKSEL_EXTXOSC_3MHZ_8MHZ_14CK_65MS_gc ALREADY DEFINED as '(0x1C)' NOT '(0x0D)' */
/* WARNING: FUSE_SUT_CKSEL_EXTXOSC_3MHZ_8MHZ_14CK_0MS_gc ALREADY DEFINED as '(0x2C)' NOT '(0x1D)' */
/* WARNING: FUSE_SUT_CKSEL_EXTXOSC_3MHZ_8MHZ_14CK_4MS1_gc ALREADY DEFINED as '(0x0C)' NOT '(0x2D)' */
/* WARNING: FUSE_SUT_CKSEL_EXTXOSC_3MHZ_8MHZ_14CK_65MS_gc ALREADY DEFINED as '(0x1C)' NOT '(0x3D)' */
#define FUSE_SUT_CKSEL_EXTXOSC_8MHZ_XX_14CK_4MS1_gc     (0x0E) /* Ext. Crystal Osc. 8.0-    MHz; Start-up time: 14 CK + 4.1 ms */
#define FUSE_SUT_CKSEL_EXTXOSC_8MHZ_XX_14CK_65MS_gc     (0x1E) /* Ext. Crystal Osc. 8.0-    MHz; Start-up time: 14 CK + 65 ms */
#define FUSE_SUT_CKSEL_EXTXOSC_8MHZ_XX_14CK_0MS_gc      (0x2E) /* Ext. Crystal Osc. 8.0-    MHz; Start-up time: 14 CK + 0 ms */
/* WARNING: FUSE_SUT_CKSEL_EXTXOSC_8MHZ_XX_14CK_4MS1_gc ALREADY DEFINED as '(0x0E)' NOT '(0x3E)' */
/* WARNING: FUSE_SUT_CKSEL_EXTXOSC_8MHZ_XX_14CK_65MS_gc ALREADY DEFINED as '(0x1E)' NOT '(0x0F)' */
/* WARNING: FUSE_SUT_CKSEL_EXTXOSC_8MHZ_XX_14CK_0MS_gc ALREADY DEFINED as '(0x2E)' NOT '(0x1F)' */
/* WARNING: FUSE_SUT_CKSEL_EXTXOSC_8MHZ_XX_14CK_4MS1_gc ALREADY DEFINED as '(0x0E)' NOT '(0x2F)' */
/* WARNING: FUSE_SUT_CKSEL_EXTXOSC_8MHZ_XX_14CK_65MS_gc ALREADY DEFINED as '(0x1E)' NOT '(0x3F)' */


